src/test/java/org/incode/estatio/services/invoice.json

{
    "$$href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoice/157302",
    "$$title": "3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019",
    "$$instanceId": "157302",
    "datanucleusIdLong": 157302,
    "datanucleusVersionLong": 5,
    "applicationTenancy": {
        "rel": "urn:org.restfulobjects:rels/value",
        "href": "http://estatio-test.int.ecpnv.com/restful/objects/isissecurity.ApplicationTenancy/s_/FRA",
        "method": "GET",
        "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
        "title": "/FRA"
    },
        "approvalState": "New",
    "approvedFully": false,
    "atPath": "/FRA",
    "bankAccount": {
        "rel": "urn:org.restfulobjects:rels/value",
        "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.financial.bankaccount.BankAccount/6882",
        "method": "GET",
        "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
        "title": "FR60 1234 1234 1234 1234 1234 XXX - FR11269 (VERIFIED)"
    },
    "buyer": {
        "rel": "urn:org.restfulobjects:rels/value",
        "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.party.Organisation/1019",
        "method": "GET",
        "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
        "title": "TEST PROPERTY FRANCE SAS [FR01]"
    },
    "collectionNumber": null,
    "communicationNumber": null,
    "currency": {
        "rel": "urn:org.restfulobjects:rels/value",
        "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.currency.Currency/1",
        "method": "GET",
        "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
        "title": "Euro [EUR]"
    },
    "dateReceived": "2019-06-26",
    "dueDate": "2019-07-24",
    "grossAmount": "20251.20",
    "invoiceDate": "2019-06-24",
    "invoiceNumber": "1234.1644.2019",
    "netAmount": "16876.00",
    "netAmountLinked": "16876.00",
    "nextApprovalTaskRoleAssignedTo": {
        "rel": "urn:org.restfulobjects:rels/value",
        "href": "http://estatio-test.int.ecpnv.com/restful/objects/dbo.PartyRoleType/4",
        "method": "GET",
        "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
        "title": "Project Manager [PROJECT_MANAGER]"
    },
    "nextApprovalTaskTransitionType": "Approve",
    "paymentMethod": "Bank Transfer",
    "pdf": "some encode pdf",
    "pendingApprovalTask": {
        "rel": "urn:org.restfulobjects:rels/value",
        "href": "http://estatio-test.int.ecpnv.com/restful/objects/task.Task/43427",
        "method": "GET",
        "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
        "title": "Complete (non conforme au contrat avancement OPC, courrier R AR): 3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019 - estatio-user-fr"
    },
    "previousComments": "REJECT: non conforme au contrat avancement OPC, courrier R AR (aleroy@ecp.loc)\n",
    "property": {
        "rel": "urn:org.restfulobjects:rels/value",
        "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.asset.Property/1301",
        "method": "GET",
        "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
        "title": "Test property [GH]"
    },
    "seller": {
        "rel": "urn:org.restfulobjects:rels/value",
        "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.party.Organisation/4594",
        "method": "GET",
        "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
        "title": "TEST SUPPLIER [FR11269]"
    },
    "totalGrossAmount": "20251.20",
    "totalNetAmount": "16876.00",
    "totalVatAmount": "3375.20",
    "type": "Capex",
    "useAsTemplate": false,
    "vatAmount": "3375.20",
    "approvalTasks": [
        {
            "$$href": "http://estatio-test.int.ecpnv.com/restful/objects/task.Task/43427",
            "$$title": "Complete (non conforme au contrat avancement OPC, courrier R AR): 3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019 - estatio-user-fr",
            "$$instanceId": "43427",
            "description": "Complete (non conforme au contrat avancement OPC, courrier R AR)",
            "object": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoice/157302",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019"
            },
            "createdOn": "2019-07-22T15:01:28Z",
            "note": null,
            "applicationTenancy": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/isissecurity.ApplicationTenancy/s_/FRA",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "/FRA"
            },
            "atPath": "/FRA",
            "datanucleusIdLong": 43427,
            "datanucleusVersionLong": 1,
            "assignedTo": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/dbo.PartyRoleType/34",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "Incoming Invoice Manager [INCOMING_INVOICE_MANAGER]"
            },
            "personAssignedTo": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.party.Person/3304",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "Tester, Clarisse [CTester]"
            },
            "completed": false,
            "completedBy": null,
            "completedOn": null,
            "comment": null,
            "pdf": "some encode pdf"
        },
        {
            "$$href": "http://estatio-test.int.ecpnv.com/restful/objects/task.Task/42253",
            "$$title": "Complete: 3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019 - INCOMING_INVOICE_MANAGER",
            "$$instanceId": "42253",
            "description": "Complete",
            "object": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoice/157302",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019"
            },
            "createdOn": "2019-07-05T14:53:25Z",
            "note": null,
            "applicationTenancy": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/isissecurity.ApplicationTenancy/s_/FRA",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "/FRA"
            },
            "atPath": "/FRA",
            "datanucleusIdLong": 42253,
            "datanucleusVersionLong": 2,
            "assignedTo": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/dbo.PartyRoleType/34",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "Incoming Invoice Manager [INCOMING_INVOICE_MANAGER]"
            },
            "completed": true,
            "completedBy": "test@test.com",
            "completedOn": "2019-07-05T14:55:26Z",
            "comment": null,
            "pdf": "some encode pdf"
        }
    ],
    "approvalTransitions": [
        {
            "$$href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoiceApprovalStateTransition/72704",
            "$$title": "Pending: Complete",
            "$$instanceId": "72704",
            "datanucleusIdLong": 72704,
            "comment": null,
            "completed": false,
            "completedBy": null,
            "completedOn": null,
            "createdOn": "2019-07-22T15:01:28Z",
            "fromState": "New",
            "invoice": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoice/157302",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019"
            },
            "task": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/task.Task/43427",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "Complete (non conforme au contrat avancement OPC, courrier R AR): 3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019 - estatio-user-fr"
            },
            "toState": null,
            "transitionType": "Complete"
        },
        {
            "$$href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoiceApprovalStateTransition/72703",
            "$$title": "New",
            "$$instanceId": "72703",
            "datanucleusIdLong": 72703,
            "comment": "non conforme au contrat avancement OPC, courrier R AR",
            "completed": true,
            "completedBy": "aleroy@ecp.loc",
            "completedOn": "2019-07-22T15:01:28Z",
            "createdOn": "2019-07-22T15:01:28Z",
            "fromState": "Completed",
            "invoice": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoice/157302",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019"
            },
            "toState": "New",
            "transitionType": "Reject"
        },
        {
            "$$href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoiceApprovalStateTransition/70657",
            "$$title": "Completed (test@test.com)",
            "$$instanceId": "70657",
            "datanucleusIdLong": 70657,
            "comment": null,
            "completed": true,
            "completedBy": "test@test.com",
            "completedOn": "2019-07-05T14:55:26Z",
            "createdOn": "2019-07-05T14:53:25Z",
            "fromState": "New",
            "invoice": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoice/157302",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019"
            },
            "task": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/task.Task/42253",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "Complete: 3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019 - INCOMING_INVOICE_MANAGER"
            },
            "toState": "Completed",
            "transitionType": "Complete"
        },
        {
            "$$href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoiceApprovalStateTransition/70656",
            "$$title": "New",
            "$$instanceId": "70656",
            "datanucleusIdLong": 70656,
            "comment": null,
            "completed": true,
            "completedBy": "test@test.com",
            "completedOn": "2019-07-05T14:53:25Z",
            "createdOn": "2019-07-05T14:53:25Z",
            "fromState": null,
            "invoice": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoice/157302",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019"
            },
            "toState": "New",
            "transitionType": "Instantiate"
        }
    ],
    "attributes": [],
    "documents": [
        {
            "$$href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.invoice.paperclips.PaperclipForInvoice/121918",
            "$$title": "[INCOMING_INVOICE] 3010104609.pdf (02-07-2019 02:53) attached to 3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019 ",
            "$$instanceId": "121918",
            "datanucleusIdLong": 121918,
            "attachedTo": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoice/157302",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019"
            },
            "document": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/incodedocuments.Document/73148",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "[INCOMING_INVOICE] 3010104609.pdf (02-07-2019 02:53)"
            },
            "documentDate": "2019-07-02T14:53:59Z",
            "documentState": "Rendered",
            "invoice": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoice/157302",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019"
            },
            "roleName": null
        }
    ],
    "items": [
        {
            "$$href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoiceItem/404467",
            "$$title": "3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019 > PROJECT MANAGEMENT [PROJECT MANAGEMENT]",
            "$$instanceId": "404467",
            "datanucleusIdLong": 404467,
            "datanucleusVersionLong": 2,
            "applicationTenancy": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/isissecurity.ApplicationTenancy/s_/FRA",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "/FRA"
            },
            "atPath": "/FRA",
            "charge": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.charge.Charge/242",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "PROJECT MANAGEMENT [PROJECT MANAGEMENT]"
            },
            "chargeEndDate": null,
            "chargeStartDate": null,
            "description": "Refurbishment of the shopping centre",
            "dueDate": "2019-07-24",
            "effectiveEndDate": null,
            "effectiveStartDate": null,
            "endDate": "2020-06-30",
            "fixedAsset": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.asset.Property/1301",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "Test Property [GH]"
            },
            "grossAmount": "20251.20",
            "incomingInvoiceType": "Capex",
            "invoice": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoice/157302",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019"
            },
            "linkedAmount": "16876.00",
            "netAmount": "16876.00",
            "orderItem": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/orders.OrderItem/2842",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "Refurbishment of the shopping centre  outstanding 21426.00  of: 139825.00   PROJECT MANAGEMENT  order:  D 02 2018"
            },
            "project": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.capex.dom.project.Project/143",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "GH-MAJOR REFURB"
            },
            "quantity": null,
            "reportedDate": "2019-07-15",
            "sequence": "1",
            "startDate": "2019-07-01",
            "tax": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.tax.Tax/14",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "TVA normal [FRF]"
            },
            "type": "Invoiced",
            "vatAmount": "3375.20",
            "vatPercentage": null
        }
    ],
    "linkedOrderItems": [
        {
            "$$href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.capex.dom.orderinvoice.viewmodel.LinkedOrderItemViewModel/PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPG1lbWVudG8-PG5ldEFtb3VudD4xMzk4MjUuMDA8L25ldEFtb3VudD48bmV0QW1vdW50SW52b2ljZWQ-MTE4Mzk5LjAwPC9uZXRBbW91bnRJbnZvaWNlZD48b3JkZXJJdGVtLmJvb2ttYXJrPm9yZGVycy5PcmRlckl0ZW06Mjg0Mjwvb3JkZXJJdGVtLmJvb2ttYXJrPjwvbWVtZW50bz4=",
            "$$title": "Untitled Linked Order Item View Model",
            "$$instanceId": "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPG1lbWVudG8-PG5ldEFtb3VudD4xMzk4MjUuMDA8L25ldEFtb3VudD48bmV0QW1vdW50SW52b2ljZWQ-MTE4Mzk5LjAwPC9uZXRBbW91bnRJbnZvaWNlZD48b3JkZXJJdGVtLmJvb2ttYXJrPm9yZGVycy5PcmRlckl0ZW06Mjg0Mjwvb3JkZXJJdGVtLmJvb2ttYXJrPjwvbWVtZW50bz4=",
            "netAmount": "139825.00",
            "netAmountInvoiced": "118399.00",
            "orderItem": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/orders.OrderItem/2842",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "Refurbishment of the shopping centre  outstanding 21426.00  of: 139825.00   PROJECT MANAGEMENT  order:  D 02 2018"
            }
        }
    ],
    "outstandingOrderItemsForSeller": [
        {
            "$$href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.capex.dom.order.viewmodel.OrderItemPresentationViewmodel/PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPG1lbWVudG8-PHNlbGxlck9yZGVyUmVmZXJlbmNlPkQgMDIgMjAxODwvc2VsbGVyT3JkZXJSZWZlcmVuY2U-PG91dHN0YW5kaW5nQW1vdW50PjIxNDI2LjAwPC9vdXRzdGFuZGluZ0Ftb3VudD48bmV0QW1vdW50PjEzOTgyNS4wMDwvbmV0QW1vdW50PjxkZXNjcmlwdGlvbj5SZWZ1cmJpc2htZW50IG9mIHRoZSBzaG9wcGluZyBjZW50cmU8L2Rlc2NyaXB0aW9uPjxvcmRlckl0ZW0uYm9va21hcms-b3JkZXJzLk9yZGVySXRlbToyODQyPC9vcmRlckl0ZW0uYm9va21hcms-PC9tZW1lbnRvPg==",
            "$$title": "Untitled Order Item Presentation Viewmodel",
            "$$instanceId": "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPG1lbWVudG8-PHNlbGxlck9yZGVyUmVmZXJlbmNlPkQgMDIgMjAxODwvc2VsbGVyT3JkZXJSZWZlcmVuY2U-PG91dHN0YW5kaW5nQW1vdW50PjIxNDI2LjAwPC9vdXRzdGFuZGluZ0Ftb3VudD48bmV0QW1vdW50PjEzOTgyNS4wMDwvbmV0QW1vdW50PjxkZXNjcmlwdGlvbj5SZWZ1cmJpc2htZW50IG9mIHRoZSBzaG9wcGluZyBjZW50cmU8L2Rlc2NyaXB0aW9uPjxvcmRlckl0ZW0uYm9va21hcms-b3JkZXJzLk9yZGVySXRlbToyODQyPC9vcmRlckl0ZW0uYm9va21hcms-PC9tZW1lbnRvPg==",
            "sellerOrderReference": "D 02 2018",
            "outstandingAmount": "21426.00",
            "netAmount": "139825.00",
            "description": "Refurbishment of the shopping centre",
            "orderItem": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/orders.OrderItem/2842",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "Refurbishment of the shopping centre  outstanding 21426.00  of: 139825.00   PROJECT MANAGEMENT  order:  D 02 2018"
            }
        }
    ],
    "payments": [],
    "$$ro": {
        "links": [
            {
                "rel": "self",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoice/157302",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019"
            },
            {
                "rel": "describedby",
                "href": "http://estatio-test.int.ecpnv.com/restful/domain-types/incomingInvoice.IncomingInvoice",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/domain-type\""
            },
            {
                "rel": "urn:org.apache.isis.restfulobjects:rels/object-layout",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoice/157302/object-layout",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object-layout-bs3\""
            },
            {
                "rel": "urn:org.apache.isis.restfulobjects:rels/object-icon",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/incomingInvoice.IncomingInvoice/157302/image",
                "method": "GET",
                "type": "image/png"
            }
        ],
        "extensions": {
            "oid": "incomingInvoice.IncomingInvoice:157302"
        },
        "title": "3010104609:  TEST SUPPLIER [FR11269],  03FF.1644.2019",
        "domainType": "incomingInvoice.IncomingInvoice",
        "instanceId": "157302",
        "members": {
            "applicationTenancy": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/isissecurity.ApplicationTenancy/s_/FRA",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "/FRA"
            },
            "approvalState": "New",
            "approvedFully": false,
            "atPath": "/FRA",
            "bankAccount": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.financial.bankaccount.BankAccount/6882",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "FR60 1144 9000 0303 1169 6001 L62 - FR11269 (VERIFIED)"
            },
            "buyer": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.party.Organisation/1019",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "TEST BUYER FRANCE SAS [FR01]"
            },
            "collectionNumber": null,
            "communicationNumber": null,
            "currency": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.currency.Currency/1",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "Euro [EUR]"
            },
            "dateReceived": "2019-06-26",
            "dueDate": "2019-07-24",
            "grossAmount": "20251.20",
            "invoiceDate": "2019-06-24",
            "invoiceNumber": "03FF.1644.2019",
            "netAmount": "16876.00",
            "netAmountLinked": "16876.00",
            "nextApprovalTaskRoleAssignedTo": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/dbo.PartyRoleType/4",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "Project Manager [PROJECT_MANAGER]"
            },
            "nextApprovalTaskTransitionType": "Approve",
            "paymentMethod": "Bank Transfer",
            "pdf": "some encode pdf",
            "pendingApprovalTask": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/task.Task/43427",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "Complete "
            },
            "previousComments": "REJECT: non conforme au contrat avancement OPC, courrier R AR (aleroy@ecp.loc)\n",
            "property": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.asset.Property/1301",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "Test property"
            },
            "seller": {
                "rel": "urn:org.restfulobjects:rels/value",
                "href": "http://estatio-test.int.ecpnv.com/restful/objects/org.estatio.dom.party.Organisation/4594",
                "method": "GET",
                "type": "application/json;profile=\"urn:org.restfulobjects:repr-types/object\"",
                "title": "TEST SELLER [FR11269]"
            },
            "totalGrossAmount": "20251.20",
            "totalNetAmount": "16876.00",
            "totalVatAmount": "3375.20",
            "type": "Capex",
            "useAsTemplate": false,
            "vatAmount": "3375.20",
            "datanucleusIdLong": 157302,
            "datanucleusVersionLong": 5
        }
    }
}